<?php
  
    Class Lovepoems
    {
		
        private $lovepoems_data=array();
		
		public function __construct() 
		{
			 $this->lovepoems_data[0] = Array
        (
            "ab_content" => "لاتغيب عن عيني وتروح",
            "number" => "1",
            "significance" => "دام انا مغليك بالله راعني
			 وارفق بقلب غذا كله جروح
			 سهم حبك بالضماير صابني
			 يابعد روحي ترى ماني شحوح
			 خذ عيوني كان قلبك طاعني
			 بس عطني كلمه فيها وضوح
			 وكان انا غلطان بالصد جازني
			 عيني لشوفك بها شوق لحوح
			 كل ماسجيت طيفك زارني
			 انت لك بالقلب يالغالي صروح
			 ماتغير لو ضميرك باعني
			 بس لاتقسى علي يوم وتروح
			 وانت خابر كيف بعدك تاعبني",
 
        );

    $this->lovepoems_data[1] = Array
        (
            "ab_content" => "سوي كنك مادريت وحبني..!!",
            "number" => "2",
            "significance" => "وسوها ثاني على انك تعتذر
			 وقول اسف مانتبهت وضمني
			 والعذر مقبول ولك مني شكر
			 وكرر الغلطه معاي وخلني
			 انتظر عذرك بكل فارغ الصبر
			 جيبني ثم ودني ثم جيبني
			 من حدود الشمس لحدود القمر
			 وين ماتبغى فديتك ودني 
			 خادمك ياسيدي تحت الامر
			 هد حيلي بالغرام وهدني
			 والله اني ناذر لحبك نذر
			 تكفى بعثرني شظايا ولمني
			 في كفوفك يابعد كل البشر
			 وراح اسوي كني دخت وضمني
			 وراح اقولك امزح واحبك واعتذر",
        );

    $this->lovepoems_data[2] = Array
        (
            "ab_content" => "احتجتلك",
            "number" => "3",
            "significance" => "يأاطيب بشر وين الا قيك؟
			 وين الحنان اللي بغيته وين الاقيه..
			 في ضيقتي
			 في ضحكتي
			 بس أناديك
			 دامك تحس بضيقتي ليه اعاني..
			 رفيق دربي فرحتي بين اياديك
			 انسى التعب وانسى الشقا والاماني
			 رفيق دربي كل ماغبت ابكيك
			 تعال شوف بدنيتي من بكاني 
			 ارجوك لاتترك حبيبك ومغليك
			 لاغبت انا من هو يصير بمكاني
			 ودي اموت بحضنك اليوم وابكيك
			 وليا بكيتك طاري البعد جاني
			 ابيك
			 ايه ابيك
			 وابيك
			 وابيك
			 محتاجه لك
			 في كل شي بزماني
			 احتجتلك..وان احتجتلك
			 وين الاقيك؟
			 ابي حنانك واعترف ماكفاني..",
        );

    $this->lovepoems_data[3] = Array
        (
            "ab_content" =>"بلا عنوان",
            "number" => "4",
            "significance" => "ليت كلماتي تخفف عن غيابك
			 ليتني دايم معك وانتي تضحكين
			 ليت كلماتي تجفف كل همك
			 وامسح دموعك وابدلها بحنين
			 لو تقولي الآه اشعرها معك
			 تكتئب دنياي ولا اشوفك حزين
			 انا أغليك وسط قلبي موقعك
			 حتى روحي تحت امرك لو تبين",
        );

    $this->lovepoems_data[4] = Array
        (
            "ab_content" => "بلا عنوان",
            "number" => "5",
            "significance" => "تأخذين العقل وانتي ساكته يانور عيني ،
			 كيف أجل لوتسكت الدنيا عشان تسولفين
			 لوسمحتِ ....
			 من حلا شلال همساتكِ عطيني
			 حدري من همسه اشفاتكِ
			 سواليف الحنين ,,,,
			 حسسيني
			 بالمكان
			 وبالأمان
			 وحسسيني
			 ان حبي يكبر بقلبكِ مثل ماتكبرين",
        );
		}
		
		public function getData($number){
			//get the value here and return the result
			foreach($this->lovepoems_data as $value){
				if($value['number']==$number){
					return $this->lovepoems_data[$number-1];
				}
		    }
	
	    }
    }
?>
